{
    "about": {
        "title": "About Me",
        "intro": [
            "I am a Ph.D. candidate in Computing Science based in Glasgow, UK, with a strong interest in Data Science and Machine Learning. My research focuses on foundational concepts such as algorithms and graph theory. I am passionate about applying this theoretical knowledge to design efficient software solutions for complex, real-world problems.",
            "I have more than 5 years of teaching experience in math and algorithms at undergraduate level. Furthermore, I have experience as Data Mining Analyst where I successfully implemented the mRMR feature selection algorithm using PySpark to optimize churn prediction models, demonstrating my ability to apply advanced algorithmic research to solve practical big data challenges.",
            "Outside the world of computing science, I enjoy playing football with friends and watching football matches, especially those of my favorite team, Olimpia, Paraguay.",
            "<b>I am actively seeking post-doctoral or industry positions to join after completing my Ph.D. Please get in touch if you would like to have a chat!</b>"
        ],
        "cv_title": "Curriculum Vitae",
        "cv_intro": [
            "I am a Ph.D. candidate in Computing Science based in Glasgow, UK, with a strong interest in Data Science and Machine Learning. My research focuses on foundational concepts such as algorithms and graph theory. I am passionate about applying this theoretical knowledge to design efficient software solutions for complex, real-world problems.",
            "I have more than 5 years of teaching experience in math and algorithms at undergraduate level. Furthermore, I have experience as Data Mining Analyst where I successfully implemented the mRMR feature selection algorithm using PySpark to optimize churn prediction models, demonstrating my ability to apply advanced algorithmic research to solve practical big data challenges.",
            "Outside the world of computing science, I enjoy playing football with friends and watching football matches, especially those of my favorite team, Olimpia, Paraguay."
        ],
        "cv_button": "Download CV",
        "cv_filename": "cv.pdf",
        "profile_image": "profile.jpg",
        "profile_image_alt": "A profile photo of Fabricio Mendoza Granada"
    },
    "skills": [
        "Python",
        "C++",
        "JavaScript",
        "Flask",
        "PySpark",
        "Apache Spark",
        "PostgreSQL",
        "Pandas",
        "NumPy",
        "SciPy",
        "Algorithms",
        "Data Structures",
        "Graph Theory",
        "Linear Algebra",
        "Machine Learning",
        "Feature Selection",
        "Clustering",
        "Unsupervised Learning",
        "Supervised Learning"
    ],
    "ui_text": {
        "education_title": "Education",
        "experience_title": "Work Experience",
        "projects_title": "Projects",
        "publications_title": "Publications",
        "news_title": "Latest News",
        "contact_title": "Contact Me",
        "no_experience_message": "No work experience to display yet.",
        "no_publications_message": "No publications to display yet.",
        "no_news_message": "No news yet. Check back soon!",
        "technologies_label": "Technologies",
        "live_demo_button": "Live Demo",
        "github_repo_button": "GitHub Repo",
        "published_on_prefix": "Published on",
        "date_format": "%B %d, %Y",
        "view_all_posts_button": "View All Posts",
        "blog_title": "Blog",
        "publication_link_text": "Link to Publication",
        "all_posts_title": "All Posts",
        "no_posts_found": "No posts found."
    },
    "projects": [
        {
            "id": "project-one",
            "name": "Graph Spectral Sparsifier",
            "description": "During my master's course, I implemented different graphs spectral sparsifiers in Python and C++. The implementations can be found on my GitHub.",
            "live_url": null,
            "github_urls": [
                "https://github.com/mendoza95/BSSSpectralSparsifier.git"
            ]
        },
        {
            "id": "project-two",
            "name": "mRMR Feature Selection",
            "description": "During my year in the industry, I implemented a feature selection algorithm called Minimum Redundancy Maximum Relevance (mRMR) in PySpark to improve the performance of a churn prediction model. The implementation can be found on my GitHub.",
            "live_url": null,
            "github_urls": [
                "https://github.com/mendoza95/mRMR.git"
            ]
        }
    ],
    "education": [
        {
            "id": "edu-uofg",
            "degree": "Ph.D. candidate in Computing Science",
            "institution": "University of Glasgow",
            "location": "Glasgow, United Kingdom",
            "description": "Currently a Ph.D. candidate focusing on the complexity of the b-chromatic colouring problem and related problems. Since the b-chromatic colouring problem is NP-hard in general, my work involves looking for polynomial-time solutions in restricted graph classes, such as graphs with a maximum degree of 3 and graphs with forbidden induced subgraphs. I also work on other variants of the b-chromatic colouring problem, such as the fall colouring problem and the total b-chromatic colouring problem."
        },
        {
            "id": "edu-una-msc",
            "degree": "M.Sc. in Computer Science",
            "institution": "National University of Asunción, Nucleo de Investigación y Desarrollo Tecnológico de la Facultad Politecnica",
            "location": "San Lorenzo, Paraguay",
            "description": "Course focused on general aspects of computer science and research. My master's thesis was focused on unsupervised machine learning, spectral graph theory, and communication complexity."
        },
        {
            "id": "edu-una-bsc",
            "degree": "B.Sc. in Computer Science",
            "institution": "National University of Asunción, Polytechnic School",
            "location": "San Lorenzo, Paraguay",
            "description": "A program focused on computer science fundamentals, mathematics, and programming. I graduated with a strong foundation in software engineering."
        }
    ],
    "experience": [
        {
            "id": "exp-uofg",
            "role": "Graduate Teaching Assistant",
            "company": "School of Computing Science, University of Glasgow",
            "location": "Glasgow, United Kingdom",
            "description": "I am responsible for leading lab tutorials for the undergraduate courses Algorithmic Foundations and Algorithms and Data Structures. In Algorithmic Foundations, students learn about discrete mathematics, proof methods, and graph theory. In Algorithms and Data Structures, students learn about sorting algorithms, complexity analysis, and data structures like linked lists and trees."
        },
        {
            "id": "exp-nucleo",
            "role": "Data Mining Analyst",
            "company": "Nucleo S.A., Paraguay",
            "location": "Asuncion, Paraguay",
            "description": "Implemented the Minimum Redundancy Maximum Relevance (mRMR) feature selection algorithm in PySpark to optimize a churn prediction model. Conducted research on state-of-the-art feature selection techniques and applied them to large-scale datasets using Apache Spark. Successfully enhanced model performance by identifying key predictive features. The implementation is open-source and available on GitHub."
        },
        {
            "id": "exp-una-ta",
            "role": "Teaching Assistant",
            "company": "National University of Asunción, Engineering School, Paraguay",
            "location": "San Lorenzo, Paraguay",
            "description": "I have been a teaching assistant on the course of algorithms on the undergraduate course of Mechatronic Engineering. My weekly duties were preparing classes notes on undergraduate topics such as sorting algorithms, divide and conquer algorithms, greedy algorithms, dynamic programming, linear programming, fundamental graph algorithms and the game tree and alpha-beta pruning algorithms."
        }
    ],
    "publications": [
        {
            "id": "pub-b-chromatic",
            "title": "Total b-chromatic colouring of graphs",
            "authors": "Fabricio Mendoza Granada and David Manlove",
            "journal": "Proceedings of the XIII Latin American Algorithms, Graphs and Optimization Symposium (LAGOS)"
        },
        {
            "id": "pub-distributed-spectral-sparsification",
            "title": "A Distributed Algorithm for Spectral Sparsification of Graphs with Applications to Data Clustering",
            "authors": "Fabricio Mendoza Granada and Marcos Villagra",
            "journal": "Proceedings of the 18th Cologne-Twente  Workshop on Graphs and Combinatorial  Optimization (CTW)"
        },
        {
            "id": "pub-noh-forehead-communication-complexity",
            "title": "Number-On-Forehead Communication Complexity of Data Clustering with Sunflowers",
            "authors": "Fabricio Mendoza Granada and Marcos Villagra",
            "journal": "Anais do IV Encontro de Teoria da Computação."
        },
        {
            "id": "pub-hard-easy-l-tromino-tilings",
            "title": "Hard and Easy Instances of L-Tromino Tilings",
            "authors": "Akagi, J. T., Gaona, C. F., Mendoza, F., Saikia, M. P., and Villagra, M.",
            "journal": "International Workshop on Algorithms and Computation"
        },
        {
            "id": "pub-spectral-sparsification-data-clustering",
            "title": "Distributed spectral clustering on the coordinator model",
            "authors": "Fabricio Mendoza Granada and Marcos Villagra",
            "journal": "Proceeding Series of the Brazilian Society of Computational and Applied Mathematics"
        }
    ]
}